[
  {
      "id": 1,
      "company": "The Clorox Company",
      "logo": "./images/thecloroxcompany.jpeg",
      "position": "Assistant E-Commerce Manager",
      "category": "Biz Ops",
      "postedat": "2022-08-31T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Pleasanton, CA ",
      "whoweare": "At Clorox, we champion people to be well and thrive by doing the right thing, putting people at the center, and playing to win. Led by our IGNITE strategy, we build brands that make a positive difference in people’s lives around the world. And we know that success requires head, heart, AND guts — all three, every day — coming together to work simpler, faster, bolder, and more inclusively. Interested? Join us to #IgniteYourCareer!",
      "description": "Winning at the Digital Shelf is critical component of our vision to deliver frictionless commerce experiences. We will become master storytellers and find ways to increase the relevance of our content to the consumer. Winning in these micro moments at scale requires technology and services that we will source from external partners. We are seeking a new Assistant eComm Manager in international to lead the selection, adoption, and uplift of digital shelf management services to support our vision. The leader will work across SBUs to scale contracts and practices while serving as the Power User & single POC Admin. This leader will also engage in developing and deploying processes, training, auditing and practical “hacks.” The ideal candidate will be experienced with Salsify and Profitero (or eStore Media) and is comfortable working with diverse teams across countries and time zones. Three to five years existing experience with our US businesses and agencies, including Electro & Stackline, is a bonus. The work requires self-motivation, project management, detail orientation, and strong communication skills. Exceptional candidates will have an eye for design - both written and visual – and intuition for what content is compelling for shoppers as they research and buy products online.",
      "requirements": "Experienced with digital shelf tools & content service providers, such as Salsify and Profitero/eStore. Exceptional project management skills and cross-functional team leadership via informal influence required; ability to simultaneously manage multiple projects. Prior agency management experience ideal. Can drive SOW, adherence and continuously improving performance. Strong verbal and written communication. Can communicate clearly with team members where English is second language. Able to work independently, build and implement process and training material to proactively develop others. A knack for simplifying complexity. Highly proactive, analytically-driven and fact-based in approach to challenges. Able to be successful working across borders with diverse teams and markets in different time zones. Organized with strong follow-up and attention to detail. Curious with an internal drive toward continuous learning and improvement",
      "joblink": "https://www.linkedin.com/jobs/view/3207718784/",
      "datets": null,
      "featured": true
  },
  {
      "id": 2,
      "company": "Dylan's Candy Bar",
      "logo": "./images/dylanscandybar.jpeg",
      "position": "Assistant Manager Ecommerce",
      "category": "Biz Ops",
      "postedat": "2022-09-07T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "New York, NY",
      "whoweare": "In 2001, Dylan Lauren pioneered the world’s largest confectionery emporium and lifestyle brand, Dylan’s Candy Bar. We are celebrating 20 years of merging fashion, art, and pop culture with candy to ignite the creative spirit & inner child in everyone who visits our stores and website. This innovative concept has changed the way the world experiences candy and has inspired Retail-tainment. Our whimsical destinations attract people of all ages with state-of-the-art décor and trend-setting products. Dylan’s Candy Bar offers something for everyone for every special occasion, with an unparalleled selection of candies from around the world to luxe gift baskets and chic presents.\n",
      "description": "The Assistant Manager of E-Commerce works with the Ecommerce Manager, Content and Marketing Team to support promotional set up, site merchandising and marketing.",
      "requirements": "Bachelor's degree with a specialization in business or retail merchandising preferred. Minimum of 1-3 years of experience in a ecommerce/merchandising role. Ability to problem solve and work independently. A passion for our products and our customers - you champion a \"customer first\" mindset that strengthens our understanding of the category and shoppers. Excellent written & verbal communication skills and comfortable working in a remote environment. Strong analytical and problem-solving skills, including the ability to effectively apply knowledge by creating action plans (solid Excel skills). Excellent attention to detail and the ability to successfully multi-task in a deadline driven atmosphere, while understanding big-picture objectives and strategy. Must be flexible and easily adapt to change as business priorities shift",
      "joblink": "https://www.linkedin.com/jobs/view/3250831703/",
      "datets": null,
      "featured": true
  },
  {
      "id": 3,
      "company": "Seek Thermal",
      "logo": "./images/seekthermal.jpeg",
      "position": "E-Commerce Manager",
      "category": "Biz Ops",
      "postedat": "2022-08-31T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Goleta, CA ",
      "whoweare": "The company was founded in 2012 by two industry pioneering scientists, Bill Parrish, PhD and Tim Fitzgibbons PhD, who spent 40 years advancing the state of military and professional-grade thermal imaging technology. Following their previous two companies, Amber Engineering, and Indigo Systems, each with successful acquisitions, Seek Thermal is their third venture with the mission to make thermal imaging a part of everyday life. An unseen world of energy surrounds us. We only see some of it with our eyes, light from a source of energy reflected on objects around us. But even though we can’t see it, all objects produce or retain heat. When viewed through a Seek Thermal camera, this world of heat can be converted to images, providing important information useful in solving everyday problems that are otherwise invisible to the naked eye. Seek thermal imaging lets you see the world of heat instead of the world of light. Seek Thermal is partnered with Raytheon and NXP to design and deliver high-quality, affordable thermal imaging sensors and products across the globe at scale. As one of the few companies in the world capable of building sensors, Seek Thermal has shipped hundreds of thousands of thermal imaging products around the world as it continues to make thermal imaging an accessible, everyday tool, so people can do their jobs safer, faster, and smarter.",
      "description": "We are looking for a E-Commerce Manager with a relentless mindset for global growth. The candidate must be data driven in their approach, testing and optimization. The preferred candidate has a proven track record in manage direct e-commerce channels alongside Amazon seller central channels. They must be an expert in the full e-commerce funnel from customer acquisition flows at media placements all the way to customer transaction locations. This position will report to the Director, Marketing. Must be a U.S. Citizen or Permanent Resident. Position may work a hybrid of in office and remote, however the role must be geographically located in Santa Barbara County.",
      "requirements": "Bachelor's degree in business administration, marketing, communications, or a related field. In unique cases, extensive work experience can substitute for degree requirements. 5+ years in a E-Commerce Manager role with emphasis on e-commerce. Must be a U.S. Citizen or Permanent Resident Must be a data-driven personality with a relentless pursuit for continuous improvement. Proven track record of e-commerce growth using paid social, paid search, and ABM. Must demonstrate working knowledge and previous collaboration between a direct store and Amazon. Must have experience managing an amazon seller central account. Experience using NetSuite’s Suite Commerce preferred. Certifications on relevant digital marketing platforms is a plus\nProficiency in Google Analytics required. Strong writing and copy skills to test varying words, phrases, and styles within digital platforms .Strong in analytics and able to translate data insights into successful marketing strategies. Ability to multi-task in a rapid paced environment. Strong sense for self-direction with the ability to take ownership and initiative. Strong presentation skills with experience conveying key points to adopt change",
      "joblink": "https://www.linkedin.com/jobs/view/3245524697/",
      "datets": null
  },
  {
      "id": 4,
      "company": "Outdoor Research",
      "logo": "./images/outdoorresearch.jpeg",
      "position": "Product Manager",
      "category": "Product",
      "postedat": "2022-09-14T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Seattle, WA ",
      "whoweare": "At Outdoor Research®, we built a company from a feeling: the urge to get out. It's what drives us. We love coming to work every day and inventing ever better solutions to what nature throws our way. But we're more than just the gear we build. We're part of a community of friends whose lives are connected by our common need to be outside. Our community is devoted to exploring our outdoor passions and challenging ourselves in the mountains, water, and deserts of the planet we love so much.",
      "description": "The OR Pro product line manager is responsible for the overall direction of the OR Pro business at Outdoor Research which includes: Men’s and Women’s tops, bottoms, outwear and gear. The candidate will be responsible to ensure that their success is in line with the company's expectations. They will strive to increase profitability of existing products, while also helping to develop new products. The OR Pro product manager will work across all departments of the company, including sourcing, materials, sales, operations, design, tech design, innovation, marketing, and manufacturing. They must be able to effectively collaborate and communicate both cross-functionally on the product team and with these departments to meet company expectations, account and consumer demands. The OR Pro product manager must possess mathematical and analytical abilities to develop pricing models and forecast product profitability. This requires the product manager to analyze technical, financial, marketing, and sales information for the product line. Using this data, they must prepare product development objectives and schedules for all phases of product development and product launch strategy. To ensure the success of various product lines, the product manager must use a combination of marketing data analysis, personal experience, and customer/athlete/influencer input. The product line manager must stay up to date with market changes and current market perceptions. They must then be able to communicate these results to cross-functional counterparts which may include executive members of the company, making suggestions on how to better improve current product lines and/or how Outdoor Research can enter underdeveloped market segments. Lastly, in this role, the OR Pro product manager will be required to work directly with manufacturing partners which may or may not include outside design talent. They will be responsible for communicating directly to their manufacturing partners, including traveling to meet with them in person if necessary.",
      "requirements": "Bachelor’s degree in Merchandising, Marketing, Business or a related field. Minimum 5 years’ experience managing an apparel line. Fluent in written and spoken English. Proficient in Excel, Power-Point, Word. Experience with Illustrator and In-Design, a plus, will be required to use Illustrator",
      "joblink": "https://www.linkedin.com/jobs/view/3270748726/",
      "datets": null
  },
  {
      "id": 5,
      "company": "ShopStyle",
      "logo": "./images/shopstyle.jpeg",
      "position": "Product Manager, App Experience",
      "category": "Product",
      "postedat": "2022-09-08T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "South Floral Park, NY",
      "whoweare": "Ready to join a fashion search tech start-up poised for growth and scale? ShopStyle’s purpose is to spark a fresh perspective on a shopper's style universe. We are growing and transforming the foundation of how shoppers search for fashion and style trends, brands and retailers.",
      "description": "As such, ShopStyle is looking for a Product Manager to help build and scale ShopStyle's consumer business, specifically our app experience. The person we are seeking will be excited about developing and testing theories to ensure that customers receive a best in class app experience. You’ll have a material impact on improving conversion rates, customer experience and lifetime value. This role will oversee innovative mobile centric UX enhancements, funnel optimization, and new digital improvements that support a frictionless journey. Most importantly, you’ll work with an amazing marketing, design, analytics and engineering team alongside a very talented product team. You should be passionate about owning and defining your roadmap, delivering on OKRs and delivering a frictionless experience. We learn from each other, our data, the marketplace and our customers, and apply those learnings to improve our offerings. Key Responsibilities:  Responsible for modernizing our ios and android app experience, elevating, expanding shoppable content (trends, outfitting, video, deals, etc) and personalized experience. Collect and leverage implicit and explicit data to drive a curated and personalized experience across the app home tab, search and browse. Assure product adoption to increase member retention and value; iterate and optimize. Work with marketing and engineering to become one of the most recognized personalized shopping apps within the app store. Help lead, from ideation to analysis to testing to iteration, the creation of new products and features for ShopStyle’s consumer apps Conduct opportunity analyses on new and or existing features and product improvements. Compose clear and concise feature requirements and use these to build consensus throughout the organization. Understand our data, build insights and strategies utilizing a data-first approach, always thinking of the “why” in your approach to feature development\nLead and deliver in-depth and comprehensive analyses of new product features. Coordinate closely with engineering, design, and QA throughout the product development process. Collaborate with marketing, business development, sales, and community teams to ensure that your work is understood by the organization and aligned with stakeholders.",
      "requirements": "A bachelor's degree or higher. At least 3-5 years experience in product management, data analysis, consulting, or UX role at a technology company. Strong/Advanced Excel Skills,\nAdvanced Skills with Amplitude, Tableau or other data analysis software/language. Strong communication skills. Proven ability to execute. eCommerce, mobile apps (consumer facing). Passion for online shopping preferred. Experience designing, executing, and analyzing a/b tests, specifically around user behavior.. Experience writing product requirements for multi-platform technology products and/or features.. Experience developing, pitching, and executing business plans and/or product roadmaps. Experience working with and/or managing developers to release products and features. Experience in managing complex releases. Experience ideating and working with visual and user experience designers.",
      "joblink": "https://www.linkedin.com/jobs/view/3219912063",
      "datets": null
  },
  {
      "id": 6,
      "company": "DICK'S Sporting Goods",
      "logo": "./images/dickssportinggoods.jpeg",
      "position": "Product Manager II - HR & Teammate Experience Technology",
      "category": "Biz Ops",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Coraopolis, PA",
      "whoweare": "Welcome to Product Management at DICK’S Sporting Goods, where we specialize in delivering retail excellence along every aspect of the customer journey. Our mission focuses on crafting intuitive, easy-to-use products that span across our business. We are looking for a new team member who can bring product-market viability ideas that inspire, innovate and deliver elevated experiences for our customers and products. Every season starts at DICK’s! Join the team that powers the people, process and passion at DICK’s Sporting Goods. In the Corporate Technology portfolio, we maximize our teammates through Human Resources and Intelligent Automation; are fiscally sound via Finance and Treasury; and maintain our stores and distribution centers by responsible, sustainable means. Our mission is to make DICK’S Sporting Goods a brand that is recognized for leveling the playing field when it comes to inclusion, raises the bar by delivering Athletes innovative products, and protects our home court by being stewards of Sport.\n",
      "description": "As a Product Manager II, you will work closely with other product managers, product designers and software engineers to deliver products and services that align to strategic priorities as well as achieve product-market fit. You will be an active participant in the organization and deliver high-quality products through the following: Product Strategy- You will define a roadmap for your product in collaboration with your technology peers and stakeholders within a modern development environment. Your roadmap will be based in outcomes, establishing a “voice of the product” that empathizes with your customers’ and stakeholders’ needs. Data-Driven Decisions- You will establish metrics and measurements for your product domain to report on value delivered. Using lagging and leading indicators’ performance to inform product iterations and prioritization within the roadmap. Testing and Research- Lean experimentation is a core value within a product team. You will aid in the formulation of hypotheses to coordinate A/B tests, prototypes or research, continually refining the product until the desired outcome is achieved. Delivery- Part of the job is to manage the backlog. You will create effective user stories as well as lead backlog prioritization and management; performing testing of product features with engineers to ensure acceptance criteria is met, capture bugs and work towards defect resolution. Team Collaboration- Working as a team is essential for success! You will actively participate in stand ups, planning sessions, demos and retrospectives with your team on a weekly basis.",
      "requirements": "An intermediate understanding of Product Management. Understanding of product lifecycle. Knowledge of human-centered design principles. Understanding of software development lifecycle. Ability to balance business objectives and customer needs. Demonstrated success defining & launching successful products. A customer-centric view into developing great product experiences and the ability to advocate on a customer’s behalf\nA foundational understanding of Scrum and Agile. Ability to influence cross-functional teams without formal authority. Strong written and verbal communication skills. Strong deductive reasoning skills. A curious attitude and desire to learn. Ability to effectively collaborate and build relationship with various peer groups. Experience working with third party vendors",
      "joblink": "https://www.linkedin.com/jobs/view/3236466662/",
      "datets": null
  },
  {
      "id": 7,
      "company": "Newell Brands",
      "logo": "./images/newellbrands.jpeg",
      "position": "SEO Manager",
      "category": "Marketing",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Hoboken, NJ ",
      "whoweare": "Newell Brands (NASDAQ: NWL) is a leading global consumer goods company with a strong portfolio of well-known brands, including Paper Mate, Sharpie, Dymo, EXPO, Parker, Elmers, Coleman, Marmot, Oster, Sunbeam, FoodSaver, Mr. Coffee, Graco, Baby Jogger, NUK, Calphalon, Rubbermaid, Contigo, First Alert, and Yankee Candle. For hundreds of millions of consumers, Newell Brands makes life better every day, where they live, learn, work and play. Newell Brands and its subsidiaries are Equal OpportunityEmployers and comply with applicable employment laws. EOE/M/F/Vet/Disabled are encouraged to apply.",
      "description": "The SEO Manager role is a new role on a high visibility team responsible for building the SEO strategy across a range of well-known sites including Yankee Candle, Graco Baby, Sharpie, Marmot, Crock Pot, and many others. This role will require the flexibility to provide both high-level strategic recommendations and the work that goes into executing said strategy. This role will work closely with Project Management, Merchandising, Production & Creative stakeholders as well as Development teams. We are seeking a candidate that has the right mix of passion for SEO and technical aptitude to drive optimization across a wide range of site types and teams. Lead process of tracking SEO traffic and keyword performance for a substantial amount of DTC and marketing sites, working toward goals aligned on for each division. Identify growth opportunities by analyzing existing content architecture, keyword research, audits, and data/traffic analysis. Update and monitor monthly SEO reporting dashboards, providing insights on traffic and keyword performance changes. Partner with Senior SEO Manager and division/brand teams to align on SEO KPIs goals and spearhead work carved out to achieve them. Perform ongoing quarterly and ad-hoc diagnostic crawls on sites to monitor site health including areas such as status code errors, duplicate content, missing metadata and schema errors. Identify new content opportunities, collaborating with digital content team on copy recommendations based on competitive research and white space identification. Support Senior SEO Manager in international migrations including redirect mapping, pre- vs post-launch audits, copy reviewing, navigation recommendations.",
      "requirements": "4+ years of dedicated SEO experience, in-house experience preferred. A passion for all things SEO, and an interest in SEO-related self-education. Fluency in all three SEO pilllars, especially technical and on-page. SEO experience working with large scale websites. SEO experience working on ecommerce sites. Strong verbal and communication skills, and can adapt your SEO knowledge and findings based on audience. Experience with site migrations. Self-starter, experience in optimizing websites from the ground up. Deep knowledge of SEO content creation. Experience working with Salesforce Commerce Cloud and JIRA. Experience working with relevant SEO tools: Screaming Frog, Google Analytics, Google Search Console, Conductor Searchlight, ahrefs\nStrong experience working in Excel and Google Data Studio",
      "joblink": "https://www.linkedin.com/jobs/view/3142100851/",
      "datets": null
  },
  {
      "id": 8,
      "company": "Volcom",
      "logo": "./images/volcom.jpeg",
      "position": "Digital Content & Marketing Coordinator",
      "category": "Marketing",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "(Hybrid) Costa Mesa, CA ",
      "whoweare": "We were born to chase what we are true to. It's not that we want to... WE HAVE TO. We have a vision that turns obstacles into opportunity. A creative courage to tempt the impossible... And embrace the strange. Telling us to push further... To try again. Endlessly seeking elevation... We are all connected by this same internal force. Forever we chase that intoxicating moment when our vision is realized... The world around us goes quiet... And for brief moments, we are more than alive.\n",
      "description": "This role will support the Global Marketing Department, helping our brands expand their digital reach. The ideal candidate will have years of experience in the Surf Industry and the social / digital world. The main responsibilities will be running multiple social handles, creating content and managing digital assets. Accountable for pulling together social media reports and metrics. Creating and following brand campaign calendars. Also capable of handling administrative duties for the department. Social Media: Manage & run multiple social channels. Creating copy for captions on social channels. Create calendars and align on seasonal product releases. Use Sprout to plan out social posting schedule. Use Grin for seeding product to influencers & collaborators. Grin incentive metric analyzation. Contribute and create content for all social platforms. Skills in photo and video editing. Pull social reports and metrics from Hookit. eCommerce / E-mails: Aligning with ecommerce & digital team on content calendar. Working closely with the ecommerce teams and aligning on product stories. Creating copy for website and e-mails. Creating copy for product needs. Administrative: Organizing digital assets on DropBox and delivering to the proper teams\nManaging all photo and video assets. Assist with events like art shows, premieres, tours & concerts. Booking travel and coordinating trips. Submitting invoices and reimbursements. Shipping samples to team riders. Communicating with the art department & tracking art requests. Assist in content creation trips & events",
      "requirements": "3+ years of experience in marketing or related field. Bachelor’s degree preferred. Works well under pressure with a solution-oriented approach to problems. Ability to work with all personality types in a fast pace environment. Works quickly and efficiently with an ability to learn quickly and adapt to change. Detail-oriented with excellent time management and organizational skills (very important). Exceptional written, verbal, and interpersonal communication skills. Ability to work in a highly ambiguous environment. Should be able to take general instructions and drive projects to completion. Excellent communication skills, both written and verbal. Must be a team player. Must be proficient in all Microsoft Office products, specifically Outlook and Excel. Active on Social Media and understand digital marketing. Must take initiative, be a go-getter and a fast learner",
      "joblink": "https://www.linkedin.com/jobs/view/3269138157/",
      "datets": null
  },
  {
      "id": 9,
      "company": "ABT Electronics",
      "logo": "./images/abtelectronics.jpeg",
      "position": "Paid Search Manager",
      "category": "Marketing",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Glenview, IL",
      "whoweare": "Abt was founded in 1936 when Jewel Abt gave her husband David $800 to start a business. Abt began as a small store with only three employees in the Logan Square neighborhood of Chicago. Abt has since grown to become one of the largest independent single-store appliance and electronics retailers in the country, situated on 68 acres in Glenview, IL, and employing a staff of more than 1,600 trained experts. Today, Abt carries tens of thousands of products in a variety of categories including appliances/custom kitchens, gourmet cooking, home comfort (HVAC, power generators and sump pumps), TV and A/V, computers, furniture, mattresses, watches, fitness, and more - many of which are introduced exclusively at Abt before gaining widespread distribution.",
      "description": "Abt Electronics has an immediate opening for the position of a Paid Search Manager. We are a family owned company who has been in business since 1936 and continues to experience strong growth year after year. The Paid Search Manager will join the Abt team to assist in paid search strategic planning, investment and execution perspectives. You will support the process of bringing the paid search function in-house at Abt while partnering closely with other leaders within the digital marketing team. You will build relationships with external search partners including our Google team and technologies that assist in optimizing our campaigns. In addition, must be comfortable contributing/working in an entrepreneurial, fast-paced and fun work environment. Primary duties include: Manage Paid Search, Shopping and YouTube campaigns Assist in campaign development, bid strategies, optimization and channel management. Catalog feed optimization Analyze the full customer journey and attribution reports. Develop A/B testing strategies. Research and identify new customer segments for targeted search campaigns. Manage, organize, and present KPI reporting across Google and Bing. Be a key member on the digital marketing team and work directly with the Director of Digital Marketing",
      "requirements": "3-5 years of experience in search engine marketing required. Bachelors in Marketing, Business, Economics, Finance or related field. Experience with campaign management and bid optimization tools (SA 360, Kenshoo, Marin). Knowledge of product feed optimization tools (Feedonomics). Knowledge of Google Analytics and Adwords required. Strong quantitative skills required to analyze and optimize campaign performance. Expert in Excel and comfortable learning new business intelligence and vendor reporting tools. Attention to detail and the ability to effectively multi-task in a data driven team. Retail experience required. Must work in Glenview, IL location, this is not a remote position.",
      "joblink": "https://www.linkedin.com/jobs/view/3276526180",
      "datets": null
  },
  {
      "id": 10,
      "company": "AlphaBroder",
      "logo": "./images/alphabroder.jpeg",
      "position": "E-Commerce Manager",
      "category": "Biz Ops",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Feasterville-Trevose, PA",
      "whoweare": "Without knowing it, millions of people wear apparel and accessories distributed by alphabroder. Consumers may not recognize the company's name, but clothiers and promotional agencies certainly do. Whether the item is a company golf shirt, a T-shirt from a rock concert or a souvenir shirt from a vacation destination, chances are it has passed through one of our many Distribution Centers across North America.",
      "description": "The Ecommerce Manager role supports the Ecommerce division of the Marketing Department in the development and execution of alphabroder’s online sales channels. The role is also responsible for the management of online content, tracking user data, translating that data into actionable goals, and serving as project manager for ongoing enhancements of our online sales channels. Ecommerce Managers work with the Director of Ecommerce to ensure alphabroder’s online sales channels continue to meet evolving best practices, offer superior customer experiences, and serve established business goals. Point-person who is accountable for day-to-day (weekly, monthly, etc.) management of website updates, issues, etc. Work daily with IT (Web Developers and QA) to launch web fixes and enhancements on time. Create project requirement documents that map out new features for project submission. Develop a strong understanding of our customers' needs, particularly during the buying process in order to optimize user experience and user interface. Work closely with Demand Generation, and various business stakeholders to create and maintain time-sensitive website content. Continually monitor the website in a proactive manner to ensure that information is accurate, content is current, and pages are free of errors. Become the expert on Google Tools, especially Google Analytics, and provide weekly (and as needed) reports/and analysis on various topics, KPIs, initiatives, etc.\nProvide support to our website's dedicated customer service team and sales. Create/update and publish to Confluence how-to and web requirements.",
      "requirements": "3-5 years’ experience in digital marketing and/or ecommerce. Strong capacity for multi-tasking, working independently and time management. Ability to constructively challenge existing logic and/or processes to develop the best solution for both the customer and business. Strong problem-solving skills with the ability to look for creative solutions. Strong organizational skills and attention to detail. Competency pulling reports and interpreting basic website analytics, experience in Google Analytics/GA4. Familiarity with user interface/experience, quality assurance and testing. Strong verbal and written communication skills that can be applied inter/intra. Highly motivated. Ability to take initiative and prioritize workload. Project management experience preferred. Experience with Excel, PowerPoint, MS Word. HTML & CSS experience would be a plus",
      "joblink": "https://www.linkedin.com/jobs/view/3276547812",
      "datets": null
  },
  {
      "id": 11,
      "company": "Robidoux, Inc. ",
      "logo": "./images/robidoux.jpeg",
      "position": "Social Media Content Creator",
      "category": "Creative",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Lincoln, NE",
      "whoweare": "Robidoux Inc. is a family-owned business founded in 1979 in Lincoln Nebraska. We started out selling compressed air & industrial items and doing custom fabrication. In the mid-1990s, we expanded into other markets allowing us to grow our company and started selling pellet grills and smokers. If you have not tried a pellet grill, we highly recommend it. We continued to grow our company, and around 2009, we started selling a small assortment of car-audio electronics. We opened a division in our retail location to specialize in car audio installations including speakers, amplifiers, remote starts, keyless entry, and other accessories.",
      "description": "Robidoux inc. is looking to add another Social Media Content Creator. Our Social Media Content Creators our a key part of our business and its success. As a Social Media Content Creator at Robidoux Inc you would be responsible for building the social media posts, including pictures, media, and video across Instagram, TikTok, Facebook and more. Reels, stories, and other social media content is critical as we grow our business. Keeping up with the current trends and managing the growth of social accounts is a must. To be successful in this role you must be a great people person, eager to learn, a great teammate, self-motivated, and able to work independently. Our Social Media Content Creator must enjoy spending time on social media, be creative, and driven to outperform. If this sounds like an environment you can make an impact to, we encourage you to apply today!\n",
      "requirements": "Must work in office and not a remote location. Must have high school diploma or equivalent education. Must be at least 18 years of age. Have great computer skills and experienced social media background. Exceptional proof reading, spelling and grammar skills. Full or Part Time position\n",
      "joblink": "https://www.linkedin.com/jobs/view/3268793541/",
      "datets": null
  },
  {
      "id": 12,
      "company": "Macy's",
      "logo": "./images/macys.jpeg",
      "position": "User Experience Designer Lead",
      "category": "Web Development",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "New York, NY ",
      "whoweare": "Macy’s is proudly America’s Department Store. For more than 160 years, Macy’s has served generations at every stage of their lives. Customers come to us for fashion, value and celebration. Now is an exciting time to join Macy’s, Inc. The face of retail is changing, and change requires innovation. Macy's is the largest NYC based digital retailer and has driven more than ten consecutive years of double-digit growth. We’re building a new type of customer-centric shopping experience - at the intersection of content, commerce, and technology - to help customers find and buy products they love.",
      "description": "Macy’s Inc. seeks a passionate, team-oriented Senior UX Designer to join its Customer Experience organization to play a key role in shaping the user experience design for Macy’s.com, Macy’s app, and Macy’s retail stores. The Senior UX Designer plays a key role in realizing Macy’s strategic vision through the design of engaging user experiences. Candidates should have a minimum of 5 years of experience designing across digital channels. Strong candidates will have a proven track record of delivering elegant, world-class designs in a fast paced collaborative team environment, solving business goals and user needs, working and influencing in a cross-functional context, and using research and data to inform the design of user experiences. In addition to being an individual contributor, the Senior UX Designer will mentor UX Designers and Associate UX Designers, and guide their efforts to align with Macy’s strategic vision. The candidate is responsible to perform other duties as assigned.",
      "requirements": "BA/BS in Design Required, preferably in UX related fields of HCI, Industrial Design, Product Design, Architecture or Graphic Design. Minimum 5 years UX/UI design experience across consumer mobile applications, websites, or retail stores. Project Management experience with a solutions oriented mind-set. Excellent communication skills. Excellent customer service, interpersonal, communication and organizational skills. Ability to multitask and work cross functionally with multiple business partners.",
      "joblink": "https://www.linkedin.com/jobs/view/3275279707/",
      "datets": null
  },
  {
      "id": 13,
      "company": "Custom Ink",
      "logo": "./images/customink.jpeg",
      "position": "Senior UX Designer ",
      "category": "Web Development",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Virginia, United States",
      "whoweare": "Custom Ink is a user-centric product company whose goal is to be the go-to platform for custom-designed products. As a Senior UX Designer, you will help guide the evolution and direction of our e-commerce platform. You will be a member of the central design system team and a senior designer for our UX team",
      "description": "As a Senior UX Designer, you will contribute to an evolving product vision and add to the inspiring creative direction for our digital products and services. In this role, you will. Lead and oversee the user experience delivery from concept to launch, in partnership with UX architects, product managers, and engineering. Take conceptual ideas, explore and iterate, and narrow to optimal solutions while maintaining momentum. Define, craft and evolve designs within visual systems and/or standards.\nBe an evangelist for designing with a systematic approach, educating fellow designers and engineers about best practices for working with shared components/patterns. Help deliver scalable design processes, tools, and practices for governance, workflows, and documentation for sharing. Understand user needs, goals and behaviors and translates them into thoughtful user journeys. Master core skills (visual design and interaction design) and soft skills (empathy, curiosity, collaboration, and communication) as you create an amazing experience In this role, you will work closely with many other members of the Technology team and other stakeholders across Custom Ink to achieve cross-functional wins for the company.",
      "requirements": "As a Senior UX Designer, you are passionate about great customer experiences and empathize with users’ goals and challenges. A successful candidate will have: 5+ years of experience creating consumer-facing digital products in an in-house environment. Previous Design System experience. A background in user experience, visual, and interaction design. Software experience: Advanced Adobe Creative Suite proficiency, Sketch & InVision experience; CSS, HTML. A portfolio demonstrating your passion for simple, intuitive, and beautiful user-centered designs. Excellent communicator, ability to communicate complex interaction concepts clearly and persuasively across different audiences, and varying levels of the organization. Strong storytelling prowess – You can weave insights into compelling narratives that bring stakeholders onboard and influence your team members; you have a natural ability to clearly articulate design decisions in a compelling way.",
      "joblink": "https://www.linkedin.com/jobs/view/3097302355/",
      "datets": null
  },
  {
      "id": 14,
      "company": "Bose",
      "logo": "./images/bose.jpeg",
      "position": "Social Media Content Manager",
      "category": "Creative",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Framingham, MA ",
      "whoweare": "Bose is a global leader in consumer audio and one of the world’s most admired brands. For over 50 years we’ve been pushing the limits of what’s possible to bring astonishing audio to people in their homes, on the go, in automobiles, and wherever else we can impact people’s lives through the power of sound. Bose relies on outstanding people! Our culture of customer-centricity, innovation, collaboration, and empowerment is what makes Bose a great place to work. We’re inventing the future of audio and transforming the company for the many exciting opportunities that lie ahead. If you thrive in a fast-paced, technology-driven environment and you have a passion to deliver products and experiences that customers love, then we want to hear from you!",
      "description": "We’re looking for a passionate and motivated Social Media Content Manager to join our growing Global Social Media team. This role is responsible for leading the content strategy and execution of original video, partnership, and event content for Bose’s owned and paid social channels. This includes ideating original content, managing creative and production agencies, serving as client lead on shoots, and supporting tentpole brand moments and product marketing campaigns. This role sits on the Global Social Media team and will work cross-functionally with Partnerships, Media, Website, and Creative teams. This role will also work alongside another Social Media Content Manager and a Social Media Content Specialist.",
      "requirements": "Deep understanding of the social media and digital landscape, content and media trends, paid media, and online consumer behavior. Strong written and verbal communication skills. Proven success in original and/or campaign video content strategy and execution. Proven multi-tasking ability and strong project management skills. Willing to work in a fast-paced environment with an openness to change. 5+ years of relevant experience in content development and production, paid media, and social media community management (agency or client side). Experience with social media and influencer publishing, listening, and tracking platforms (e.g. Sprinklr, Tagger, or similar). Familiarity and interest in music, sports, gaming, and/or TV/film preferred, but not necessary.",
      "joblink": "https://www.linkedin.com/jobs/view/3137951547/",
      "datets": null
  },
  {
      "id": 15,
      "company": "Hasbro",
      "logo": "./images/hasbro.jpeg",
      "position": "Sales Manager",
      "category": "Sales",
      "postedat": "2022-09-17T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Providence, RI",
      "whoweare": "At Hasbro we’re changing the face of play and entertainment. We’re looking for people who want to explore, experiment and innovate to come up with the best ideas. Our culture of community, passion, integrity, creativity and inclusion has inspired our diverse team of highly skilled, highly creative and highly committed individuals for 90+ years and we believe the best is yet to come.",
      "description": "The Amazon Sales Manager maximizes our sales opportunity with Hasbro’s action brand portfolio on Amazon. They develop business plans with the ecommerce channel in mind and build internal and external alignment. They implement their strategy with cross-functional teamwork and communication. The Sales Manager creates and develops customer relationships: Understands the needs of their accounts and communicates what those needs are and how to best deliver on those needs. They work closely with Amazon to develop mutually helpful strategies and tactics. They know Amazon’s key performance indicators and recommends items and brands. They are flexible and understands planogram needs as well as Amazon marketing platform levers. The Sales Manager is responsible for delivering revenue targets within the action brands category! Forecasts accurately, develops and leads joint business plans and customers commitments. Tracks POS and adjusts plans accordingly. Uses promotional support to increase sales and manages their customer budgets. This candidate builds internal relationships! Works with cross-functional teams: marketing, product development, account support, logistics, accounts payables, finance, flow planning, data management. This candidate will be their channel expert and share industry knowledge: They are the specialist within their channel of business.",
      "requirements": "BBA/BA/BS. 5+ years of experience in a high-paced, driven environment, with a consistent track record for achieving and exceeding sales goals. Excellent negotiation skills. Strong relationship building and collaboration skills. Excellent verbal communication and presentation skills. Strong time management, prioritization, planning, and organization skills. Results-oriented individual, with a sense of urgency. Sophisticated analytical/Excel/PC skills. 20% Travel required",
      "joblink": "https://www.linkedin.com/jobs/view/3272165826/",
      "datets": null
  },
  {
      "id": 16,
      "company": "Clover Sonoma",
      "logo": "./images/cloversonoma.jpeg",
      "position": "Digital Marketing Coordinator",
      "category": "Marketing",
      "postedat": "2022-09-15T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "(Hybrid) Sonoma County, CA",
      "whoweare": "Third-generation family owned and operated, Clover Sonoma is recognized as a leader at the forefront of the dairy industry. The Petaluma-based company in Northern California’s beautiful Sonoma County was the first dairy in the United States to become American Humane Certified, and hold its partnership of family-owned dairy farms to a higher standard by developing its own unique Clover Promise of Excellence. Clover Sonoma is proud to bring conscious dairy products direct from its farms to consumers. As a Certified B Corporation®, the company uses its business as a force for good, and its passionate support of animal welfare, sustainable business practices, and local community have always been hallmarks of the business. Each year the company gives back at least five percent of its profits to support these passions under its Clover Cares program. ",
      "description": "This role is a great opportunity for a recent college graduate or someone with marketing or social media experience looking to gain more! The Digital Marketing Coordinator will work to support the execution of our brand marketing plans – across social, web, and digital. They will oversee maintenance and updates, and key responsibility areas could include but are not limited to: website updates, social media community, influencers, content development for social, project management, newsletters, contests, etc.. Hybrid role: 2-3 days in office per week. Monitor and update social media accounts; support our social and influencer community Learn our voice and write engaging photo captions for Instagram and Facebook; and respond to consumer questions, comments, etc. Build and maintain the monthly social media calendar with inputs from Sr Manager, VP of Marketing, and other team members. Pitch new ideas for social media, especially for channels where we are currently lacking a presence\nResearch and keep team informed of competitors successes and shortcomings, as well as relevant brands that exhibit best in class social, digital, and web. Help compile, review and communicate monthly/quarterly reports on social/digital marketing performance Act as asset collector and support in reorganizing the server. Gathering feedback from internal team, typing up meeting notes, and support timeline management. Supporting digital programs, including but not limited to digital and social advertising, search marketing (SEO/SEM), email communications, and website design/development. Content creation for newsletter/blog content. Support in working alongside digital agency, providing direction and briefing. Monitors the website, helping to catch any bugs and make edits such as to job postings, blog posts, recipes, etc. Admin support in booking meetings, updating status, mailings, filing, etc.Other marketing projects and duties as assigned. ",
      "requirements": "1-3 years of work experience working in social media/digital marketing at an agency or in-house. Bachelor’s degree in Communications, Public Relations, Journalism, English, Business/Marketing, or a related field. Passionate about social media, technology, and the ever-changing digital landscape. Strong familiarity with social media: Instagram, TikTok, Facebook, Pinterest, YouTube, Twitter, LinkedIn, etc. Strong writing skills and attention to detail. Ability to create and edit documents in Microsoft Word, PowerPoint and Excel. Experience with timelines and/or scheduling. Working knowledge of Google – Gmail, Drive, Calendar, etc. WordPress, and basic Photoshop/canva experience, a plus. \n",
      "joblink": "https://www.linkedin.com/jobs/view/3267362953/",
      "datets": null
  },
  {
      "id": 17,
      "company": "House of Hackney",
      "logo": "./images/houseofhackney.jpeg",
      "position": "Ecommerce Manager",
      "category": "Biz Ops",
      "postedat": "2022-09-13T16:00:00.000Z",
      "contract": "Full Time",
      "location": "UK",
      "city": "London, England",
      "whoweare": "House of Hackney was founded in London in 2011 by Javvy M Royle and Frieda Gormley. Originally founded as an interiors label, the brand has successfully grown to offer a full portfolio of homewares and fashion products, with an emphasis on quality, designed and Made in England. House of Hackney operates a flagship East London store and is stocked in luxury department and concept stores worldwide. Our Housemates are innovators who see the world differently and strive to make a difference within it. Each one is chosen and cherished for the skills, talents and characteristics that make them unique. As House of Hackney evolves, we empower our team to learn and grow alongside us. And, as a compassionate brand, we care about the wellbeing of our Housemates – whether that’s through offering a flexible approach to work with a four-day week over the summer or getting flexible (quite literally) in group yoga sessions.\r\n",
      "description": "The Ecommerce Trading Manager is responsible for the day to day trading of the House of Hackney website and the commercial marketing decisions of the brand. This role will protect the commercial KPIs of the website and drive global growth using analysis based decisions through marketing, merchandising and content",
      "requirements": "Extensive Ecommerce experience, preferably in a luxury retail brand. Experience of managing all online marketing channel across devices – SEO, PPC, email, social advertising etc. Outstanding analytical skills, strong experience interpreting insights and drawing conclusions to inform business decision making. Excellent communication and interpersonal skills, oral and written. Excellent attention to detail and accuracy. Strong business judgment and decisions making skills; ability to identify, prioritise and articulate highest impact initiatives.. Good knowledge of SEO and implementing it into ecommerce content. Good understanding of how to manage and implement ecommerce content. Competent in the use of analytical tools such as Google Analytics, HotJar, CRO tools etc. Great knowledge of using a CMS system (experience with Magento is desirable)",
      "joblink": "https://www.linkedin.com/jobs/view/3267644173/",
      "datets": null
  },
  {
      "id": 18,
      "company": "The LEGO Group",
      "logo": "./images/lego.jpeg",
      "position": "Paid Search Specialist",
      "category": "Marketing",
      "postedat": "2022-09-14T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Enfield, CT",
      "whoweare": "At the LEGO Group, our mission is to inspire and develop the builders of tomorrow. We believe in the power of Learning-through-Play to shape children's future. Through play, children learn skills – such as problem-solving, communication, creativity, collaboration, and resilience – that will help them reach their full potential. The LEGO® System-in-Play, with its foundation in LEGO bricks, allows children and fans of all ages to build and rebuild anything they can imagine. The LEGO name derives from the two Danish words ‘Leg Godt', which means ‘Play Well.' The LEGO Group was founded in Billund, Denmark, in 1932, by Ole Kirk Kristiansen. We still are a family-owned company with headquarters in Billund. Our play experiences are sold in more than 120 countries, and we are more than 20,000 colleagues worldwide working to achieve our ambition to bring Learning-through-Play to children everywhere",
      "description": "Uncover optimization opportunities at every stage in the search marketing funnel, and keeping a coordinated view on SEM with organic search input from our team’s SEO leads. With the channel lead work to identify and develop new performance driving opportunities for search across global markets. Work closely with the Paid Search agency ensuring that standard methodologies are followed and opportunities are being highlighted. Work with performance marketing channel leads and the digital insights team to ensure clear goals and outcomes for any activity being launched. Collaborate with external media partners e.g. Google, Bing or Adobe to ensure campaigns are activated efficiently and to industry-standard processes. Work with the channel lead and agency to develop & implement YouTube standard methodology within google ads across the marketing funnel",
      "requirements": "A good level of paid search marketing experience. Experience in search advertising across numerous markets, including non-English languages, with track record for developing both local and global campaigns. Working agency side or with a brand on search marketing, focusing on important metrics including profitability and sales growth. Strong budgeting skills, with a skill for categorizing spends across key campaign activities and planned outcomes. A standout colleague and problem solver. 2+ years shown experience in paid search marketing roles. Paid search knowledge including account and keyword strategies, Remarketing, critical metrics and targets, script development or account automation tools, and related products, e.g. Google Shopping Hands-on operational experience in bid management platforms i.e. SA360, Skai formally Kenshoo, Marin but preferably Adobe Advertising Cloud. Hands-on operational experience of search technology platforms, e.g. Google and Bing ads. Good knowledge of analytics, with experience of creating audience segments, pushing these to execution, campaign optimizations, and evaluation. i.e. Adobe Analytics or Google Analytics. Strong presentation skills and confident communicator. Can work independently, but collaboratively. Understanding of dashboarding technologies eg. Tableu, Datarama, Data Studio, omniscope etc. Fluency in French, Spanish or other languages a plus. Experience working with global campaigns and an understanding of working with language localization",
      "joblink": "https://www.linkedin.com/jobs/view/3267742282/",
      "datets": null
  },
  {
      "id": 19,
      "company": "Skims",
      "logo": "./images/skims.jpeg",
      "position": "Email and SMS campaign Manager",
      "category": "Marketing",
      "postedat": "2022-09-16T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Los Angeles, CA",
      "whoweare": "SKIMS is a solutions-oriented brand creating the next generation of underwear, loungewear and shapewear. We are setting new standards by providing solutions for every body. From technically constructed shapewear that enhances your curves to underwear that stretches to twice its size, our goal is to consistently innovate on the past and advance our industry for the future.",
      "description": "SKIMS is a solutions-oriented brand creating the future of underwear, shapewear and loungewear. We’re disrupting the industry with our game-changing product and culturally driven creative, and are looking for a Campaign Manager, Email & SMS to join our team. This individual will be responsible for developing the strategy, planning & deploying email & SMS campaigns to support our content calendar, meeting target KPIs for the SKIMS e-commerce business. The right candidate has a balance of creativity & analytical expertise with substantial practice in managing email/SMS programs at significant scale. Responsibilities: Own the email/SMS marketing calendar in collaboration with digital, ecommerce, marketing & merchandising. Brainstorm content ideas, run competitive analysis, utilize historical performance to guide future strategy. Responsible for operational set-up & deployment of all email & SMS campaigns in Klaviyo & Attentive. Coordinate with brand marketing and copy/graphic design team members for asset development. Build creative briefs for required assets and asana ticketing for delivery management. Determine strategic customer cohorts to target across the programs, building customized content for all segments and closely monitoring performance trends and email/sms performance KPIs. Build robust A/B and multivariate testing strategies to experiment with all aspects of the program (subject lines, email content, copy, timing strategies, localization efforts etc). Build daily, weekly, monthly reports to track campaign performance against targets, gather creative insights and understand cohort-level trends. Present these learnings in team meetings to neighboring departments. Plan and execute list-growth strategies across both email & SMS. Utilize dynamic personalization tools to customize content to specific audience cohorts. Monitor deliverability metrics and take action to maintain list hygiene.",
      "requirements": "4+ years of experience in digital marketing, in-house or at an agency. Experience with Klaviyo and/or Attentive (or similar ESP tools). Experience with fashion/beauty e-commerce businesses. Excellent analytical skills and highly proficient with MS Excel or similar tools. Close attention to details and highly organized. Self-motivated and takes initiative; must be able to work independently. Comfortable working in a fast-paced environment. May require some evening and/or weekend availability to support business launches",
      "joblink": "https://www.linkedin.com/jobs/view/3267929398/",
      "datets": null
  },
  {
      "id": 20,
      "company": "Etica Denim",
      "logo": "./images/eticadenim.jpeg",
      "position": "Sales Manager",
      "category": "Sales",
      "postedat": "2022-09-14T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "(Hybrid), Los Angeles Metropolitan Area",
      "whoweare": "Based in Los Angeles, ÉTICA Denim is a sustainable lifestyle brand rooted in the ideals of sustainable fashion and fair labor. A vertical organization with decades of expertise, ÉTICA Denim is ethically made and sustainably produced using industry-leading technology at our very own factories. We are looking for a stellar sales professional to join our growing team.",
      "description": "The Sales Manager will be accountable for a range of outcomes, including holistic strategies for growth, onboarding of new channel partners as well as performance improvement within current channels. This is a pivotal role with a long line of growth potential. Responsibilities: Plan and implement strategies for growth by channel to reach company sales goals. Lead brand expansion into new markets and maximize sales with existing partners. Maximize and support brand relationships with outside sales organizations, including U.S. showrooms and international distributors. Pioneer and directly manage a few key accounts, department stores and offprice retailers. Elevate brand perception and customer experience across all wholesale touch points. Manage seasonal sell-in process across all channels, ensuring that sales and merchandising goals are met. Monitor, analyze and report weekly sales and stock levels to ensure profitable business; interpret and communicate marketplace insights and competitive landscape takeaways to upper management. Oversee co-op, allowances and brand initiatives to drive sales and reduce markdowns.Plan and execute industry tradeshows and sales events",
      "requirements": "Has 6+ years of sales experience in advanced contemporary or designer markets. 3+ years of management, ideally with demonstrated team building and remote management. Recent product category experience in women’s premium denim strongly preferred. Strong relationships and experience working with international teams and key accounts, department stores and offprice retailers. Strong analytical skills; understanding of advanced retail math and retailer relationships, with ability to project on future business and provide actionable merchandising feedback. Excellent presentation skills, clearly speaks to product value and inspires excitement about sustainability. Has a collaborative spirit; enjoys team problem-solving and learning from mistakes.\nHighly detail-oriented, with proven ability to work in a fast-paced, startup environment. Proficiency with all Microsoft office programs and commonly used ERP systems (Full Circle is a plus).",
      "joblink": "https://www.linkedin.com/jobs/view/3263348942/",
      "datets": null
  },
  {
      "id": 21,
      "company": "Max Mara Fashion Group\r",
      "logo": "./images/maxmarafashion.jpeg",
      "position": "Ecommerce Coordinator",
      "category": "Biz Ops",
      "postedat": "2022-09-15T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "New York City Metropolitan Area",
      "whoweare": "An Italian House of Brands, Family Owned Since 1951. Passion, commitment and tradition have created a unique fashion style: today 10 Main Brands and more than 60 different Collections find common ground in quality, style and respect for the distinctive feature that make Max Mara Fashion Group one of the most famous worldwide. Max Mara Fashion Group, with 41 companies and over 5,500 employees, operates in 105 countries. Our ecosystem is made of 44 Depts, including Fashion Design, Marketing, Operations, Retail, Stores, ICT, Architecture Design, Economics, BI, etc. in an Holistic approach to our Customers and leveraging all the new digital competences. We are looking for travel companions. Travelers willing to explore new skills and abilities that have the shape of water and can adapt to different situations and find new paths not yet covered.",
      "description": "The eCommerce Coordinator, in partnership with the other members of the team, will support in the operational and strategic tasks required to successfully run the digital businesses of brands under Max Mara US & CAN. This role will work cross-functionally with various teams including marketing, operations, logistics, finance, and customer service to ultimately drive the performance of the digital store. Partner with HQ in Italy to manage homepage & site content updates to be in line with global communication plan Analyze seasonal product performance and collaborate with the marketing team to build and deploy an effective digital marketing calendar through newsletters. Monitor the performance of digital KPIs. Manage the eCommerce catalog to ensure timely publication of new collections. Work cross-functionally with operations and logistics to help monitor inbound and outbound shipments. Partner with finance on customer-related issues. Manage the customer care agency across all brands",
      "requirements": "BA/BS from an accredited college/university. 1-2 years experience. Excellent communication skills. Highly detailed oriented, organized and analytical. Ability to analyze existing situations and find solutions to problems. Proficient in Microsoft Excel and Word",
      "joblink": "https://www.linkedin.com/jobs/view/3271912214/",
      "datets": null
  },
  {
      "id": 22,
      "company": "Bridges Consumer Healthcare",
      "logo": "./images/bridgesconsumerhealthcare.jpeg",
      "position": "Ecommerce Specialist",
      "category": "Biz Ops",
      "postedat": "2022-09-12T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": " Chattanooga, TN",
      "whoweare": "Bridges CHC is an innovator, marketer, and distributor of over-the-counter consumer health care (OTC) products to large food, drug and mass retailers and certain mass e-tailers. The top brands in our growing portfolio include ThermaCare, Florajen, Lipo-Flavonoid, Certain Dri, and others. We are looking to add to our growing team to bring these established brands to life in the digital space.",
      "description": "The Ecommerce Associate is responsible for supporting the retail readiness of Bridges CHC product portfolio from warehouse to product detail page. They will be a key team member in the creation, maintenance, quality, and improvement of product listings across all ecommerce platforms. The Ecommerce Associate will collaborate with internal teams and external partners to support our go-to-market strategy. The Ecommerce Associate must be organized, passionate, and eager to learn and make an impact on the business. They must be able to work in a fast paced, collaborative environment across sales, marketing and regulatory to ensure the success of Bridges CHC.",
      "requirements": "Education: BA/BS degree from an accredited college required with a focus in business administration, marketing, or communications. Experience: 2-5 years proven experience in a related position. Position requires excellent communication skills; written and verbal, the ability to problem solve, oversee, and work through multiple ongoing projects, strategic thinking, time management, capacity to be nimble and learn on the fly, experience with marketplace content and media platforms, strong knowledge of retailer website mechanics (SEO, Keywords, Image optimization, etc.), critical attention to detail. A thorough understanding of the organization's operational functions to coordinate activities between multiple resources. Role Specific Competencies: Demonstrated ability to think analytically, solve problems, make decisions, and use sound judgment. Thrive in a fast-paced, constantly changing environment with tight deadlines and multiple priorities. Outstanding communication skills and willing to collaborate in a team environment. Organized with solid project management skills. Excellent written, oral, and presentation communications skills. This position requires extensive use of computer equipment. Individual must possess a demonstrated proficiency in Microsoft business software to include Excel, PowerPoint, Word, and Outlook. Proficiency and ability to master related software required. Special Requirements: Position is in Chattanooga, TN at Bridges CHC Corporate Office",
      "joblink": "https://www.linkedin.com/jobs/view/3237651996/",
      "datets": null
  },
  {
      "id": 23,
      "company": "The Salad Station",
      "logo": "./images/thesaladstation.jpeg",
      "position": "Marketing Director",
      "category": "Marketing",
      "postedat": "2022-09-18T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "Hammond, LA",
      "whoweare": "Excellent customer service, family + farming atmosphere, fresh local ingredients, and the pay by the pound concept are a few qualities that make The Salad Station unique. We pride ourselves on the friendly, fun and fresh experience our guest have when visiting our stores. The “pay by the pound” concept is very different for many, but our guest love the fact that they are paying for exactly what they created. Every ingredient on their plate was placed with a purpose.",
      "description": "Lead the Salad Station Marketing department and serve on the executive leadership team in navigating and shaping the brand's growth. The Marketing Director exists to directly affect the growth and success of The Salad Station by establishing family-like connections with our guests, increasing same-store sales, #lettucehelp community influence, and GROWING our Salad Station Dream Job through franchise opportunities. Increasing Sales, Creative Initiatives: Tell our story with a primary focus on Food, Fresh Ingredients, Family. People - emphasis, highlight, and promote \"WOW' Salad Station Experiences. Influence - Impact the community through our #lettucehelp initiative both inside and outside the restaurant. Promoting internal team culture - Lead a team of Marketing Specialist to prioritize and accomplish company marketing initiatives on time. Oversee and approve the execution of all social media campaigns, including but not limited to Instagram, Facebook, LinkedIn, Pinterest, etc.\nManage the marketing budget and ad placements. Content Creation- Weekly and monthly content to generate store traffic. Creative video, photography, and graphic images. Assist with apparel and instore signage creation. Promoting operational, food safety, new product, sampling, customer service initiatives. Partnerships and influencers with fitness, medical, schools, etc. Franchising- Lead local, regional, national Ad Campaigns. Regional Lead-Generation support for Franchise expansion. Marketing Support for a network of Franchise Operators. Collaboration and outreach with PR and News. Local store marketing campaign and budget management for franchised locations: Grass-root, community initiatives-  Digital and Print Local Store Marketing development and strategy. Paid ad placements. New rollouts and instore promotion execution. Effective communication with franchisees' marketing passions, needs, and ideas. Responding to their local marketing initiatives.",
      "requirements": "Bachelor's degree or equivalent experience in marketing, public relations, or related area of study. Minimum of 2 years' experience in a marketing position. Experience managing content on various social media platforms, including but not limited to Facebook, Instagram, Google, Yelp, Twitter, and LinkedIn. Experience with paid social media advertising. Experience with social media publishing and analytics software. Experience with Adobe Illustrator, Photoshop, Final Cut Pro, & other creative software\nExceptional time and project management skills, including the ability to handle multiple projects with changing priorities. Ability to be proactive in the planning and execution of creative projects",
      "joblink": "https://www.linkedin.com/jobs/view/3276761202/",
      "datets": null
  },
  {
      "id": 24,
      "company": "The Spotix",
      "logo": "./images/spotix.jpeg",
      "position": "Digital Marketing Specialist",
      "category": "Marketing",
      "postedat": "2022-09-18T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": "(Hybrid) North Liberty, IA",
      "whoweare": "Spotix was born from the idea that no matter where you live you should have access to the very best hearth, patio, and outdoor cooking products. Spotix is a premium, online fireplace, fire pit & grill retailer that is a degree above the rest. What sets us apart? Our team’s deep knowledge of the products we curate and our outstanding customer service. Spotix offers an industry-best experience from start to finish. We work with homeowners, do-it-yourselfers, contractors, designers, architects, and the hospitality industry, providing easy access to buying guide resources or a product expert who can be at your side before, during, and after purchase. For indoor or outdoor gathering spaces, think of Spotix as your go to resource.",
      "description": "We hire great people and give them the freedom to be awesome! Spotix is a leader in outdoor living products (Hearth, Patio & BBQ). We are a rapidly-growing E-Commerce company, located in North Liberty, Iowa. We have a unique culture that values authenticity, comfort, and fun, just as much as a strong work ethic, personal integrity, and teamwork! This is a hybrid, full-time, salaried position. Hours of work are Monday-Friday (8a -5p), no weekends required. Essential Responsibilities: Assist in the execution of Paid Search, Shopping, Marketplaces, Retargeting and Display Advertising campaigns for multiple e-commerce websites Perform day-to-day campaign tasks for paid ad accounts, including bid management, performance monitoring, ad budget allocation, forecasting, a/b testing, keyword analysis, ad copywriting & strategic reporting. Manage Google Merchant Center & oversee large product data feeds. Manage large ad budgets with a target ROAS for multiple business accounts. Apply data analysis and problem-solving skills to effectively/efficiently manage campaigns. Provide detailed campaign performance analysis/insights to senior leadership. Perform keyword research to identify new opportunities. Conduct competitor analysis and provide recommendations to improve market share. Evaluate new technologies & software to improve paid advertising efforts and processes. Execute and follow company goal initiatives throughout the year. Implement accurate conversion tracking on all paid ad accounts",
      "requirements": "Minimum 2 years experience driving online paid traffic in Google & Microsoft Advertising.. Minimum 2 years of experience with Google Analytics. Prefer B.A./B.S. in business or marketing-related fields. Experience in creating and managing substantial online ad budgets. Experience with data feed management, Google Merchant Center, and Shopping campaigns. Manage large ad accounts with limited oversight Proficient with Google Ads Editor and Microsoft Advertising Editor Proficient with Excel, Google Drive, Docs, Sheets and Slides",
      "joblink": "https://www.linkedin.com/jobs/view/3270588495/",
      "datets": null
  },
  {
      "id": 25,
      "company": "Generation Tux",
      "logo": "./images/generationtux.jpeg",
      "position": "Paid Search (PPC) Specialist/Analyst",
      "category": "Marketing",
      "postedat": "2022-09-25T16:00:00.000Z",
      "contract": "Full Time",
      "location": "USA",
      "city": " San Diego Metropolitan Area",
      "whoweare": "Generation Tux is a growing online suit and tuxedo rental company searching for an enthusiastic Paid Search Analyst to join our team. The position will be an integral part of strategizing and executing campaigns to grow brand awareness and drive revenue for the business.\n\n",
      "description": "Interface with Marketing and Dev to plan, execute, and measure experiments and conversion tests. Collaborate with marketing, design, and UX teams to create landing pages and optimize user experience. Plan and execute SEM campaigns. Measure and report performance of all search campaigns, and assess against goals (ROI and KPIs). Utilize strong analytical ability to evaluate end-to-end customer experience across multiple brands, campaigns, and customer touch points. Identify trends and insights, and optimize spend and performance based on the insights. Evaluate competitor spending, campaigns, ads, and landing pages. Evaluate emerging technologies and provide thought leadership/perspective for adoption. Brainstorm new and creative growth strategies. Adhere to brand guidelines and complete projects according to deadlines. Collaborate with agencies and other vendor partners.",
      "requirements": "Minimum of 2 - 5 years of demonstrable experience leading and managing SEM. Google Ads CertificationExperience in optimizing landing pages and user funnels. Experience with A/B and multivariate experiments. Strong analytical skills and data-driven thinking. Up-to-date with the latest trends and best practices in online marketing and measurement. Knowledge of website analytics tools-Google Analytics, etc., and data analysis. Experience with mobile campaigns. Experience in setting up and optimizing Facebook, Instagram, and Pinterest campaigns are beneficial. Experience working with agencies and third-party vendors. Exceptional communication skills. Exceptional writing skills",
      "joblink": "https://www.linkedin.com/jobs/view/3268195520/",
      "datets": null
  }, 
   {
    "id": 26,
    "company": "The Hundreds",
    "logo": "./images/thehundreds.jpeg",
    "position": "Ecommerce Manager",
    "category": "Biz Ops",
    "postedat": "2022-09-26T16:00:00.000Z",
    "contract": "Full Time",
    "location": "USA",
    "city": "Los Angeles, CA",
    "description": "Manage the launches and maintenance of products on thehundreds.com and in-store in order to maximize sales, while also delivering the best online experience for customers through updated banners, merchandizing and optimizations. Also responsible for providing reporting and analysis to upper management to guide decision-making. Core Responsibilities: Launching new products and collections. Place restock orders for best sellers/depleting stock. Maintain/update the web shop to optimize for conversion. Managing and maintaining the various digital marketing channels such as Klaviyo, Tapcart, and more. Launch monthly/semi-annual sales. Deliver daily/weekly/monthly sales reports. Manage product feeds - Facebook ads/Google shopping/Amazon",
    "requirements": "3-5 years experience in e-commerce with Shopify Plus. Experience in the fashion industry preferred. Experience with Google Analytics, data analysis and reporting. Strong computer skills including Microsoft Excel. Ability to deal with constant changes and quick turnaround times. Strong attention to detail and organizational skills. Analytical, planning and communication skills as well as the ability to work independently and manage multiple tasks. Ability to communicate clearly and concisely both verbally and in writing",
    "joblink": "https://www.linkedin.com/jobs/view/3274002502/",
    "datets": null,
    "featured": true
}

]